_drafts/hdl-slam.org
#+EXPORT_FILE_NAME: 2019-08-27-hdlslam.html
#+TITLE: HDL SLAM Series
#+KEYWORDS: 
#+OPTIONS: body-only:t
#+subtitle: 

* HDL_GRAPH_SLAM
** launch
Config parameters
#+begin_src sh
<arg name="enable_floor_detection" default="true" />
<arg name="enable_gps" default="false" />
<arg name="enable_imu_acc" default="false" />
<arg name="enable_imu_ori" default="false" />
#+end_src


#+begin_src sh
roslaunch hdl_graph_slam_[Custoimized].launch
#+end_src

** play bag file

#+begin_src sh
 rosbag play --clock mapping.bag /velodyne_gpsimu_driver/imu_data:=/gpsimu_driver/imu_data
#+end_src

** Save map

#+begin_src sh
rosservice call /hdl_graph_slam/save_map "resolution: 0.01 destination: '/home/yubao/data/Dataset/aisl_lab/map.pcd'"
#+end_src

View /pcd/ map:

#+begin_src sh
pcl_viewer map.pcd
#+end_src


* koide3/monocular_person_following
[[https://github.com/yubaoliu/monocular_person_following][Git: monocular_person_following]]

** Run

#+begin_example sh
echo "monocular_person_following start_robot"
launch monocular_person_following start_robot.launch publish_dummy_frames:=true webcam:=true camera_xyz:="0 0 0.9" camera_rpy:="0 0 0" --screen

echo "start jetson_person_following"
roslaunch monocular_person_following jetson_person_following.launch camera_name:=/top_front_camera/qhd

echo "Start Robot"
rosrun rosaria RosAria

echo "start rvize"
roscd  monocular_person_following/rviz/
rviz -d monocular_person_following.rviz
#+end_example
